Revit 2027 API
FabricationDimensionType Enumeration
 Fabrication dimension type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FabricationDimensionType
Public Enumeration FabricationDimensionType
public enum class FabricationDimensionType
type FabricationDimensionType
Members
Member name | Value | Description
Angle | 4 |  Angle.
Depth | 2 |  Depth.
Diameter | 3 |  Diameter.
Internal | 0 |  Internal.
Length | 5 |  Length.
Width | 1 |  Width.
See Also
Reference
Autodesk.Revit.DB Namespace